[
    {
      "companyImage": "https://egi10.github.io/storage/images/img_efishery.png",
      "position": "Mobile Engineer - Android",
      "startDate": "May 2022",
      "endDate": "Mar 2025",
      "descriptions": [
        "Led the migration of the Gradle build configuration from Groovy to Kotlin DSL, improving readability, consistency, and maintainability across multi-module projects.",
        "Transitioned dependency injection from Dagger2 to Hilt, reducing code complexity and improving onboarding speed for new developers.",
        "Implemented Kotlin Multiplatform (KMP) for eFeederApp across Android and iOS, enabling up to 70% shared codebase, which reduced duplication, improved consistency, and sped up feature delivery.",
        "Replaced Retrofit with Ktor Client in the shared module to streamline networking logic and ensure full compatibility with KMP.",
        "Migrated the local database layer from Room to SQLDelight, enabling reliable cross-platform persistence and maintaining data integrity across app updates.",
        "Refactored the offline-first strategy into shared code by relocating background jobs from Android’s WorkManager and exploring BGTaskScheduler integration for iOS.",
        "Led the transition from XML-based UI to Compose Multiplatform and upgraded the design system from OneFish v1 to v2, improving UI development efficiency and design consistency across platforms.",
        "Increased unit test coverage of the shared codebase to 64%, utilizing Kotlin Test, MockK, and Turbine to validate business logic and prevent regressions.",
        "Collaborated closely with product managers and QA engineers to deliver new features, resolve critical bugs, and ensure stable, on-time releases."
      ]            
    },
    {
      "companyImage": "https://egi10.github.io/storage/images/img_accurate.jpeg",
      "position": "Senior Mobile Engineer - Android",
      "startDate": "Jan 2021",
      "endDate": "Apr 2022",
      "descriptions": [
        "Led a team of three Android engineers in developing features for Accurate POS, ensuring technical alignment and team efficiency during the entire development process.",
        "Planned sprint cycles with the Product Manager, breaking down technical tasks and assigning them based on team members' strengths and priorities.",
        "Collaborated cross-functionally with product, QA, and backend teams to design, develop, and deliver features aligned with both business goals and technical feasibility.",
        "Designed and implemented a modular architecture based on MVVM and Clean Architecture to improve long-term maintainability and scalability.",
        "Adopted Hilt for dependency injection, simplifying dependency management and improving code readability.",
        "Led the migration from XML-based UI to Jetpack Compose, accelerating interface development and producing cleaner, more maintainable code.",
        "Contributed to new feature development, bug fixes, and performance enhancements to ensure optimal user experience in each iteration."
      ]          
    },
    {
      "companyImage": "https://egi10.github.io/storage/images/img_wowbid.jpeg",
      "position": "Android Developer",
      "startDate": "Nov 2019",
      "endDate": "Dec 2020",
      "descriptions": [
        "Implemented UI designs using XML, translating visual concepts from the design team into accurate and maintainable Android layouts that aligned with product specifications.",
        "Identified and fixed bugs, and performed performance optimizations to maintain system stability and improve the overall user experience.",
        "Collaborated with product, QA, and backend teams to build and deliver new features in line with defined specifications and development timelines."
      ]           
    },
    {
      "companyImage": "https://egi10.github.io/storage/images/img_mediatama.png",
      "position": "Android Developer",
      "startDate": "Mar 2019",
      "endDate": "Jul 2019",
      "descriptions": [
        "Developed and released multiple Android applications, including Hemodialysis Diary, BP Paud Dismas Sumbar, and Kasir Mediatama, using Kotlin and MVP architecture—covering the entire development cycle from implementation to Play Store publication.",
        "Provided one-on-one technical mentorship to training participants, guiding them through the fundamentals of Android development with a hands-on, structured learning approach."
      ]            
    },
    {
      "companyImage": "https://egi10.github.io/storage/images/img_mitrafin.png",
      "position": "Staff IT - Development (Android Developers)",
      "startDate": "Mar 2018",
      "endDate": "Jan 2019",
      "descriptions": [
        "Refactored legacy Android applications (APF Collector and BSM Collector) from Java to Kotlin, and implemented MVP architecture to improve code maintainability and scalability.",
        "Developed the BSM Surveyor app from scratch to release, using Kotlin and MVP pattern to deliver a clean and modular codebase.",
        "Maintained and enhanced the Buana Multidana CRM app, originally built in Java, by improving features and resolving technical issues to ensure stable operations.",
        "Handled end-to-end feature development and bug fixes across multiple Android apps to support day-to-day user needs and ensure system reliability."
      ]           
    }
  ]
  